[
    {
      "img": "images/Baba_Faqir_Chand_bw_square.png",
      "alt": "Portrait of Baba Faqir Chand",
      "bio" : "Baba Faqir Chand, (18 November 1886 - 11 September 1981) was an Indian master of Surat Shabd Yoga, or consciously controlled near death experience. He was one of the first saints or gurus of Sant Mat tradition to openly speak and write against the deceptive and harmful practices of modern guruism and religious intolerance. As a highly pragmatic individual, Faqir also strove to explain the various practices and principles of Sant Mat based on his own experiences and in the context of modern science and psychology. He was also the first Sant Mat guru to talk about the phenomena consisting of a believer experiencing a subjective projection of a sacred or holy form of a guru or idol without the conscious knowledge of the person at the center of the experience, i.e., the guru. This was termed the 'Chandian Effect', and described by researcher David C. Lane.[2][3] Faqir Chand claimed that he had no knowledge of his form manifesting before a person and helping them with their worldly or spiritual problems. He fervently expressed that in his experience, the real helper is one's own true self and faith. Mark Juergensmeyer, another researcher on new religious movements (including Radha Soami Mat), intrigued by the uniqueness of Faqir Chand's experiences, also interviewed him. This insightful interview was included in Faqir's autobiography."
    },
    {
        "img": "images/Maharishi_2.jpg",
        "alt":"Portrait of Shiv Brat Lal Verman",
        "bio" : "Shiv Brat Lal Verman, (1860 - 1939) popularly known by the honorifics 'Data Dayal' (Merciful) and 'Maharishi' (Great Sage), was born in Bhadohi district of Uttar Pradesh state in India in February 1860. He was a post graduate and a famous writer. It is believed that he wrote as many as 3,000 books on various social, historical, religious and spiritual topics. Being a famous writer he was called as the modern Maharishi Ved Vyas and hence became famous with the name Maharishi ji."
    }
]
  