[
    {
      "img": "images/Baba_Faqir_Chand_bw_square.png",
      "alt": "Portrait of Baba Faqir Chand",
      "bio" : "Baba Faqir Chand, (18 November 1886 - 11 September 1981), popularly known by the honorific 'Param Dayal' (Supremely Merciful), was a saint and spiritual researcher in the Sant Mat or Radha-Swami Mat. He practiced Surat Shabad Yoga and shared his spiritual experiences and findings openly and honestly for the benefit of all humanity. He explained the practices and principles of Sant Mat in the context of modern science and psychology. In addition to teaching the path of Surat Shabad Yoga to very select individuals who had a strong desire to find the essence of reality, he promoted the path of universal humanism by teaching that the highest religion is the practice of being human, when a human being serves another human being with love and respect. He raised the slogan “Be Human” with a mission to end religious intolerance and ignorance. He lived and promoted the principle of non-violence or non-harm in thoughts, words, and actions. He emphasized the importance of keeping physically fit and healthy, making an honest living, living a pure and peaceful life, treating everyone with love and compassion, keeping desires and lust in check, and the power of one’s mind in shaping one’s life.<br/><br/><br/>He was also the first saint or guru of Sant Mat tradition to openly speak and write against the deceptive and harmful practices of modern guruism and religious intolerance. He openly spoke against the ignorance and manipulation tactics of so called “gurus” and religious leaders. He was the first Sant Mat guru to openly talk about the phenomena consisting of a believer experiencing a subjective projection of a sacred or holy form of a guru or idol without the conscious knowledge of the person at the center of the experience, i.e., the guru. This was termed the 'Chandian Effect’ and described by researcher and professor David C. Lane. Baba Faqir Chand claimed that he had no knowledge of his form manifesting before a person and helping them with their worldly or spiritual problems. He fervently expressed that in his experience, the real helper is one's own mind, true self, and faith. Mark Juergensmeyer, another researcher on new religious movements and professor at University of California, Santa Barbara, intrigued by the uniqueness of Faqir Chand's spiritual experiences and teachings, also interviewed him. His organization called Manavta Mandir (The Temple of Humanity) is located in Hoshiarpur, Punjab, India."
    },
    {
        "img": "images/Maharishi_2.jpg",
        "alt":"Portrait of Shiv Brat Lal Verman",
        "bio" : "Shiv Brat Lal Verman, (1860 - 1939) popularly known by the honorifics 'Data Dayal' (Generous & Merciful) and 'Maharishi' (Great Sage), was the spiritual father and teacher (guru) of Baba Faqir Chand. He was a prolific writer who is believed to have written as many as 3,000 books on various social, historical, religious and spiritual topics. One of the key goals of his writings was to end religious intolerance, bigotry and ignorance. His writings explained the deeper essence and meaning in the teachings of various spiritual philosophies and religions, including Radha Swami path and Sant Mat. He was a disciple of Huzur Rai Saligram Maharaj who started the Radha-Swami spiritual movement in India and made the teachings of Sant Mat public by introducing Surat Shabad Yoga.<br/><br/><br/><i>Although I created this page primarily for the benefit of my daughter, sister, and mother, who are very blessed souls, my hope is that the teachings of these great saints will reach widely and dispel the darkness of ignorance and bring light to humanity. May you be well, happy, and peaceful!</i>"
    }
]
