[
    {
      "title": "Riddles of Kabir",
      "author": "Baba Faqir Chand",
      "description" : "The spiritual riddles of Kabir are impossible to solve if one has not practically walked the path of Kabir. Some riddles even appear nonsensical at first glance. Deeper teachings of Kabir are heavily veiled in these riddles. Here, Baba Faqir Chand solves some key riddles on the basis of his personal experiences and realizations. The hidden Kabir is finally revealed so plainly and directly.",
      "detail_page_url": "https://archive.org/details/KABIRBOOK2BABAFAQIR",
      "cover_url": "images/books/RiddlesofKabirCover.jpg",
      "pdf_url": "https://archive.org/download/KABIRBOOK2BABAFAQIR/KABIR%20BOOK%202%20-%20BABA%20FAQIR.pdf",
      "language": "Hindi"
    },
    {
      "title": "Faqir on Kabir",
      "author": "Baba Faqir Chand",
      "description" : "This book is a compilation of Baba Faqir Chand's discourses on select poems of Kabir based on his experience. Kabir's poetry is complex and often hides his sublime teachings. Baba Faqir Chand shares his experiences and insights in the light of these poems and in the process Kabir's hidden meaning is revealed in a direct way.",
      "detail_page_url": "https://archive.org/details/KABIRBOOK1BABAFAQIR",
      "cover_url": "images/books/FaqironKabirCover.jpg",
      "pdf_url": "https://archive.org/download/KABIRBOOK1BABAFAQIR/KABIR%20BOOK%201%20-%20BABA%20FAQIR.pdf",
      "language": "Hindi"
    },
    {
      "title": "The True Path of Being Human",
      "author": "Baba Faqir Chand",
      "description" : "This book is considered the magnum opus of Baba Faqir Chand's teachings for humanity and his vision of spiritual humanism. If you read no other book by Baba Faqir, read this book! We'll make every effort to translate this book into English as well.",
      "detail_page_url": "https://archive.org/details/true-human-religion",
      "cover_url": "images/books/TheTruePathofBeingHuman.jpg",
      "pdf_url": "https://archive.org/download/true-human-religion/True%20Human%20Religion.pdf",
      "language": "Hindi"
    },
    {
      "title": "Twelve Months (Barah Masa): A Spiritual Commentary",
      "author": "Baba Faqir Chand",
      "description" : "Barah Masa, which translates to 'Twelve Months', is an ancient poetic form used by mystics of India and Persia. The Barah Masa hymns are not mere descriptions of the changing seasons but also carry deeper spiritual messages. Radhaswami Shiv Dayal also composed Barah Masa to express his spiritual message. This book is the first known commentary of this mystical work. Baba Faqir Chand clarifies the meaning of Radhaswami Dayal's poetry on the basis of his own experiences and insights.",
      "detail_page_url": "https://archive.org/details/twelve-months-final-merged",
      "cover_url": "images/books/Twelve_months_final_merged.jpg",
      "pdf_url": "https://archive.org/download/twelve-months-final-merged/Twelve%20months%20final_merged.pdf",
      "language": "Hindi"
    },
    {
      "title": "RadhaSwami Yog",
      "author": "Maharishi Shiv Brat Lal Verman",
      "description" : "RadhaSwami Yog written by Data Dayal Maharishi Shiv Brat Lal Verman has the complete spiritual and philosophical teachings of the path of saints and mystics as revealed by Radhaswami Dayal. This title was originally published in 6 volumes. This is a facsimile of all 6 volumes in one place.",
      "detail_page_url": "https://archive.org/details/radhaswami-yog",
      "cover_url": "images/books/RadhaswamiYog.jpg",
      "pdf_url": "https://archive.org/download/radhaswami-yog/Radhaswami%20Yog%20%28Cover%2BComplete%29.pdf",
      "language": "Hindi"
    },
    {
      "title": "Sri Advait Siddhant (The Principles of Non-Dualism)",
      "author": "Swami Hemraj Chidakashi",
      "description" : "This rare book delves into the philosophy of non-dualism or Advaita, presenting the teachings and experience of Swami Hemraj Chidakashi, a sage of light. It also includes Swami Hemraj's perspective and guidance on the various practical challenges of daily life. He has a balanced view and encourages a balanced and peaceful life. In Advaita, the ultimate reality is considered to be one undivided, infinite, and unchanging reality, and realizing this oneness is the goal of spiritual enlightenment. In Advaita, all apparent dualities in the world, including the perceived distinction and separation between the individual consciousness (Atman) and the universal consciousness (Param-Atman), are considered illusory or false.",
      "detail_page_url": "https://archive.org/details/AdvaitSiddhantFile",
      "cover_url": "images/books/AdvaitSiddhant.jpg",
      "pdf_url": "https://archive.org/download/AdvaitSiddhantFile/Advait%20Siddhant%20file.pdf",
      "language": "Hindi"
    },
    {
      "title": "Discourses on Radhasoami Faith",
      "author": "Maharaj Brahm Shankar Misra",
      "description" : "This rare book by Maharaj Brahm Shankar Misra is his attempt to logically explain the cosmology and some principles of the path of Radhasoami Faith or Surat Shabd Yoga.",
      "detail_page_url": "https://archive.org/details/discoursesonradh00misruoft",
      "cover_url": "images/books/discoursesonradh00misruoft.png",
      "pdf_url": "https://archive.org/download/discoursesonradh00misruoft/discoursesonradh00misruoft.pdf",
      "language": "English"
    },
    {
      "title": "The Unknowing Sage: The Life and Work of Faqir Chand (Audiobook)",
      "author": "David Christopher Lane",
      "description" : "Faqir Chand (1886-1981) was a remarkable Indian sage who spent over 75 years practicing an ancient meditation technique, popularly known today as surat shabd yoga, which attempts to induce a consciously controlled near-death experience. This book contains Faqir Chand's unique autobiography which was dictated shortly before his death in Urdu and translated during his lifetime into English at the personal request of Professor David Christopher Lane. It also includes a seasoned selection of Faqir Chand's radical teachings as well as several introductory essays and pertinent interviews.",
      "detail_page_url": "https://www.amazon.com/The-Unknowing-Sage-audiobook/dp/B01EBASEDO/",
      "cover_url": "images/books/UnknowingSage.jpg",
      "pdf_url": "https://www.amazon.com/The-Unknowing-Sage-audiobook/dp/B01EBASEDO/",
      "language": "English"
},
    {
      "title": "Baba Faqir Chand's Illuminations: The London Satsangs of 1980 (Audiobook)",
      "author": "Baba Faqir Chand",
      "description" : "This is an audiobook in English of the discourses given by Baba Faqir Chand to Harjit Singh Sandhu in London, UK in 1980.",
      "detail_page_url": "https://www.amazon.com/Baba-Faqir-Chands-Illuminations-Satsangs/dp/B07JG3DRJ8/",
      "cover_url": "images/books/LondonSatsang.jpg",
      "pdf_url": "https://www.amazon.com/Baba-Faqir-Chands-Illuminations-Satsangs/dp/B07JG3DRJ8/",
      "language": "English"
}
  ]
  
